# Assignment - 6

Q1 - how to convert data strings to time series ?

In [2]:
import pandas as pd
data = {'date': ['2025-06-01', '2025-06-02', '2025-06-03'],
        'value': [10, 15, 20]}

df = pd.DataFrame(data)
print(df)

         date  value
0  2025-06-01     10
1  2025-06-02     15
2  2025-06-03     20

Q2 - Create two dataframe with a common column id -
      - perform an inner merge on this common column and display the result
      - perform a left join of df1 and df2 on id column . expain how missing values are handled in dataframe. Right join and index based join
      - perform a right join uding pd.merge() , on common column  , then perform a join using df.join() based on the index .Compare the result ,
        Merging with multiple keys

In [4]:
import pandas as pd

df1 = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['Ali', 'Jasmine', 'Charul', 'Dhruv']
})

df2 = pd.DataFrame({
    'id': [3, 4, 5, 6],
    'score': [85, 90, 75, 88]
})
#inner merge
inner_merge = pd.merge(df1, df2, on='id', how='inner')
print("Inner Merge:\n", inner_merge)

Inner Merge:
    id    name  score
0   3  Charul     85
1   4   Dhruv     90

In [8]:
# left join
left_join = pd.merge(df1, df2, on='id', how='left')
print("Left Join:\n", left_join)
#Explanation of Missing Values:
#NaN (Not a Number) appears when there is no matching id in df2.
#For example, id 1 and 2 are only in df1, so their score is NaN.

Left Join:
    id     name  score
0   1      Ali    NaN
1   2  Jasmine    NaN
2   3   Charul   85.0
3   4    Dhruv   90.0

In [10]:
#right join
right_join = pd.merge(df1, df2, on='id', how='right')
print("Right Join:\n", right_join)

Right Join:
    id    name  score
0   3  Charul     85
1   4   Dhruv     90
2   5     NaN     75
3   6     NaN     88

In [12]:
# index based join
df1_indexed = df1.set_index('id')
df2_indexed = df2.set_index('id')

index_join = df1_indexed.join(df2_indexed, how='inner')
print("Join based on index:\n", index_join)

Join based on index:
       name  score
id
3   Charul     85
4    Dhruv     90

In [14]:
# Creating DataFrames with multiple keys
df3 = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'subject': ['math', 'sci', 'eng', 'sci'],
    'marks': [60, 70, 80, 90]
})

df4 = pd.DataFrame({
    'id': [2, 2, 3, 4],
    'subject': ['sci', 'math', 'eng', 'sci'],
    'teacher': ['A', 'B', 'C', 'D']
})

multi_key_merge = pd.merge(df3, df4, on=['id', 'subject'], how='inner')
print("Multiple Key Merge:\n", multi_key_merge)

Multiple Key Merge:
    id subject  marks teacher
0   2     sci     70       A
1   3     eng     80       C
2   4     sci     90       D

Difference bet pd.merge() and df.join()

pd.merge()	
	-Can join any column	
    -More flexible for merging on multiple keys	
    -pd.merge(df1, df2, on='col')	


df.join()
    -Joins by index by default
    -Less flexible
    -df1.join(df2) or df1.join(df2.set_index())

Q3 - Create 3 dataframe . vertically concatenate 2 of them using pd.concat(),then merge the resulting dataframe with
     the third dataframe on a common key . Explain primary difference bew df.join() and pd.merge()

In [16]:
import pandas as pd

df1 = pd.DataFrame({
    'id': [1, 2],
    'name': ['Naman', 'sanjay']
})

df2 = pd.DataFrame({
    'id': [3, 4],
    'name': ['Jaya', 'Chitra']
})

df3 = pd.DataFrame({
    'id': [2, 3, 4],
    'marks': [80, 85, 90]
})

In [18]:
concat = pd.concat([df1, df2], ignore_index=True)
print("Concatenated DataFrame:\n", concat)

Concatenated DataFrame:
    id    name
0   1   Naman
1   2  sanjay
2   3    Jaya
3   4  Chitra

In [22]:
merged = pd.merge(concat, df3, on='id', how='inner')
print("Merged DataFrame:\n", merged)

Merged DataFrame:
    id    name  marks
0   2  sanjay     80
1   3    Jaya     85
2   4  Chitra     90

In [28]:
# Example merge by column
pd.merge(df1, df3, on='id', how='inner')

   id    name  marks
0   2  sanjay     80

In [26]:
# Example join by index
df1.set_index('id').join(df3.set_index('id'))

      name  marks
id
1    Naman    NaN
2   sanjay   80.0

# ---------DONE-------------------